src/Documents/ОСМИ_ДинамическаяАкция/ОСМИ_ДинамическаяАкция.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОСМИ_ДинамическаяАкция</name>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗаголовка</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстАкции</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>CatalogRef.ОСМИ_Картинки</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦветЗаголовка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветТекста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦветФона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>7</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Адресаты</name>
    <attributes>
      <name>Карта</name>
      <type>
        <types>DefinedType.ОСМИ_ДисконтнаяКарта</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/ОСМИ_ДинамическаяАкция/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Карты1С = Адресаты.ВыгрузитьКолонку("Карта");
	
	КартыОСМИ = Новый Массив;
	
	Для Каждого Карта Из Карты1С Цикл
		КартаОСМИ = ОСМИ_ОбщиеСервер.ПолучитьЭлектроннуюКарту(Карта); 
		Если не КартаОСМИ = Неопределено Тогда
			КартыОСМИ.Добавить(КартаОСМИ.Код);
		КонецЕсли;
	КонецЦикла;

	ОСМИ_РаботаСAPI.ОтправитьДинамическуюАкцию(
	Ложь,
	КартыОСМИ,
	,
	ДатаОтправки,
	ДатаЗавершения,
	ТекстЗаголовка,
	ТекстАкции,
	ТекстСообщения,
	Картинка.Код,
	ЦветЗаголовка,
	ЦветТекста,
	ЦветФона
	);

КонецПроцедуры
